const unitsData = {
    sci: {
      title: 'علوم',
      units: [
        { name: 'الوحدة الاولى', lessons: ['الدرس الاول', 'الدرس الثاني', 'الدرس الثالث', 'الدرس الرابع', 'الدرس الخامس'] },
        { name: 'الوحدة الثانية', lessons: ['الدرس الاول', 'الدرس الثاني', 'الدرس الثالث', 'الدرس الرابع', 'الدرس الخامس'] },
        { name: 'الوحدة الثالثة', lessons: ['الدرس الاول', 'الدرس الثاني', 'الدرس الثالث', 'الدرس الرابع', 'الدرس الخامس'] }
      ]
    },
    math: {
      title: 'رياضيات',
      units: [
        { name: 'الوحدة الاولى', lessons: ['الدرس الاول', 'الدرس الثاني', 'الدرس الثالث', 'الدرس الرابع', 'الدرس الخامس'] },
        { name: 'الوحدة الثانية', lessons: ['الدرس الاول', 'الدرس الثاني', 'الدرس الثالث', 'الدرس الرابع'] }
      ]
    },
    english: {
      title: 'اللغة الإنجليزية',
      units: [
        { name: 'الوحدة الاولى', lessons: ['الدرس الاول', 'الدرس الثاني', 'الدرس الثالث', 'الدرس الرابع', 'الدرس الخامس'] },
        { name: 'الوحدة الثانية', lessons: ['الدرس الاول', 'الدرس الثاني', 'الدرس الثالث', 'الدرس الرابع', 'الدرس الخامس'] }
      ]
    },
    arabic: {
      title: 'اللغة العربية',
      units: [
        { name: 'الوحدة الاولى', lessons: ['الدرس الاول', 'الدرس الثاني', 'الدرس الثالث', 'الدرس الرابع', 'الدرس الخامس'] },
        { name: 'الوحدة الثانية', lessons: ['الدرس الاول', 'الدرس الثاني', 'الدرس الثالث', 'الدرس الرابع', 'الدرس الخامس'] }
      ]
    },
    social: {
      title: 'الدراسات الاجتماعية',
      units: [
        { name: 'الوحدة الاولى', lessons: ['الدرس الاول', 'الدرس الثاني', 'الدرس الثالث'] },
        { name: 'الوحدة الثانية', lessons: ['الدرس الاول', 'الدرس الثاني', 'الدرس الثالث', 'الدرس الرابع', 'الدرس الخامس'] }
      ]
    },
    computer: {
      title: 'حاسب الي',
      units: [
        { name: 'الوحدة الاولى', lessons: ['الدرس الاول', 'الدرس الثاني', 'الدرس الثالث', 'الدرس الرابع', 'الدرس الخامس'] },
        { name: 'الوحدة الثانية', lessons: ['الدرس الاول', 'الدرس الثاني', 'الدرس الثالث', 'الدرس الرابع', 'الدرس الخامس'] }
      ]
    },
    religion: {
      title: 'التربية الدينية',
      units: [
        { name: 'الوحدة الاولى', lessons: ['الدرس الاول', 'الدرس الثاني', 'الدرس الثالث', 'الدرس الرابع'] },
        { name: 'الوحدة الثانية', lessons: ['الدرس الاول', 'الدرس الثاني', 'الدرس الثالث', 'الدرس الرابع', 'الدرس الخامس'] }
      ]
    }
  };